{
    "batch_size": 32,
    "num_epochs": 30,
    "model": {
        "class_name": "Sequential",
        "config": {
            "name": "CNNOriginalClassifier",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            28,
                            28,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "original_image"
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_12",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 64,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "HeUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": {
                            "class_name": "L2",
                            "config": {
                                "l2": 0.00019999999494757503
                            }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_13",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 64,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "HeUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": {
                            "class_name": "L2",
                            "config": {
                                "l2": 0.00019999999494757503
                            }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_6",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_8",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_14",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 128,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "HeUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": {
                            "class_name": "L2",
                            "config": {
                                "l2": 0.00019999999494757503
                            }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_15",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 128,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "HeUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": {
                            "class_name": "L2",
                            "config": {
                                "l2": 0.00019999999494757503
                            }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_7",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_9",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.3,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_16",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 256,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "HeUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": {
                            "class_name": "L2",
                            "config": {
                                "l2": 0.00019999999494757503
                            }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_17",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 256,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "HeUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": {
                            "class_name": "L2",
                            "config": {
                                "l2": 0.00019999999494757503
                            }
                        },
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_8",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_10",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.4,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_2",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_4",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 512,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "HeUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_11",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.2,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_5",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 10,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "HeUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }
            ]
        },
        "keras_version": "2.6.0",
        "backend": "tensorflow"
    },
    "optimizer": "{'class_name': 'Adam', 'config': {'name': 'Adam', 'learning_rate': 1e-04, 'decay': 3.3333333333333333e-06, 'beta_1': 0.9, 'beta_2': 0.999, 'epsilon': 1e-07, 'amsgrad': False}}"
}